In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series([1,2,3,4,1,2,3,4])
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [3]:
ser1.replace(1,np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [4]:
ser1.replace([1,4],[100,400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [5]:
ser1.replace({4:np.nan})

0    1.0
1    2.0
2    3.0
3    NaN
4    1.0
5    2.0
6    3.0
7    NaN
dtype: float64

---

#Renaming Index

In [8]:
dframe = DataFrame(np.arange(16).reshape(4,4),index=['SF','NY','LA','AM'],
                  columns=['A','B','C','D'])

In [9]:
dframe

     A   B   C   D
SF   0   1   2   3
NY   4   5   6   7
LA   8   9  10  11
AM  12  13  14  15

In [10]:
dframe.index.map(str.lower)

Index(['sf', 'ny', 'la', 'am'], dtype='object')

In [12]:
dframe.index = dframe.index.map(str.lower)

In [13]:
dframe

     A   B   C   D
sf   0   1   2   3
ny   4   5   6   7
la   8   9  10  11
am  12  13  14  15

In [14]:
dframe.rename(index = str.title,columns=str.lower)

     a   b   c   d
Sf   0   1   2   3
Ny   4   5   6   7
La   8   9  10  11
Am  12  13  14  15

In [15]:
dframe.rename(index = {'ny':'NEW YORK'},
             columns={'A':'ALPHA'})

          ALPHA   B   C   D
sf            0   1   2   3
NEW YORK      4   5   6   7
la            8   9  10  11
am           12  13  14  15

In [16]:
dframe

     A   B   C   D
sf   0   1   2   3
ny   4   5   6   7
la   8   9  10  11
am  12  13  14  15

In [17]:
dframe.rename(index = {'ny':'NEW YORK'},
             columns={'A':'ALPHA'}, inplace=True)

In [18]:
dframe

          ALPHA   B   C   D
sf            0   1   2   3
NEW YORK      4   5   6   7
la            8   9  10  11
am           12  13  14  15